test/loadTester.yml
config:
  target: "http://13.52.103.13:3000"
  phases:
    - duration: 180
      arrivalRate: 100
  variables:
    productIds:
      - ["soluta", "delectus", 'ducimus', 'similique', 'illo', 'animi', 'inventore', 'Running']
scenarios:
  - flow:
      - loop:
          - get:
              url: "/search/{{ $loopElement }}"
              # url: "/search/eligendi"
        over: productIds