test/loadTester.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 200
  variables:
    productIds:
      - ["soluta","delectus","eligendi", "adipisci","quod","minus","tempore","ut","eum","fugiat","perspiciatis"]
scenarios:
  - flow:
      - loop:
          - get:
              url: "/search/{{ $loopElement }}"
              # url: "/search/eligendi"
        over: productIds