test/loadTester.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 3000
  variables:
    productIds:
      # - ["soluta","delectus","eligendi"]
scenarios:
  - flow:
      # - loop:
          - get:
              # url: "/search/{{ $loopElement }}"
              url: "/search/eligendi"
        # over: productIds