test/loadTester.yml
config:
  target: "localhost:3000/search"
  phases:
    - duration: 60
      arrivalRate: 100
  variables:
    productIds:
      - ["soluta", "delectus", "laborum", "ut", "eum", "fugiat", "perspiciatis", "Running", "Run"]
scenarios:
  - flow:
      - loop:
          - get:
              url: "/{{ $loopElement }}"
              # url: "/search/eligendi"
        over: productIds