test/loadTester.yml
config:
  target: "http://13.52.247.137:3000"
  phases:
    - duration: 60
      arrivalRate: 100
  variables:
    productIds:
      - ["soluta", "delectus", "laborum", "ut", "eum", "fugiat", "perspiciatis", "Running", "Run"]
scenarios:
  - flow:
      - loop:
          - get:
              url: "/search/{{ $loopElement }}"
              # url: "/search/eligendi"
        over: productIds